Cinema/src/Catalogs/Фильмы/Фильмы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Фильмы</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Афиша</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ВысотаИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВыхода</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьВФильмотеке</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаполненКорректно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяФайла</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НужноСкачать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОригинальноеНазвание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПросмотреноВКино</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазмерФайла</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Формат3D</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойРелиз</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШиринаИзображения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Cinema/src/InformationRegisters/ДатыСкачиванияФильмов/ДатыСкачиванияФильмов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДатыСкачиванияФильмов</name>
  <resources>
    <name>ДатаСкачивания</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>Фильм</name>
    <type>
      <types>CatalogRef.Фильмы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Cinema/src/Catalogs/Фильмы/ObjectModule.bsl
Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЕстьВФильмотеке Тогда
		ИмяФайла = "";
	КонецЕсли;
	
	Если ПустаяСтрока(ОригинальноеНазвание) ИЛИ НЕ ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Фильмы.Код КАК Код,
		|	Фильмы.Ссылка КАК Ссылка,
		|	Фильмы.Наименование КАК Наименование
		|ИЗ
		|	Справочник.Фильмы КАК Фильмы
		|ГДЕ
		|	НЕ Фильмы.ПометкаУдаления
		|	И Фильмы.ОригинальноеНазвание = &ОригинальноеНазвание
		|	И Фильмы.Родитель = &Родитель
		|
		|УПОРЯДОЧИТЬ ПО
		|	Фильмы.ДатаВыхода");
	Запрос.УстановитьПараметр("ОригинальноеНазвание", ОригинальноеНазвание);
	Запрос.УстановитьПараметр("Родитель", Родитель);
	
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "С оригинальным наименованием """ + ОригинальноеНазвание + """ уже есть такой фильм: " + "(" + Выборка.Код + ") " + Выборка.Наименование;
		Сообщение.Поле = "ОригинальноеНазвание";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЭтоГруппа Тогда
		Если ЕстьВФильмотеке Тогда
			НаборЗаписей = РегистрыСведений.ДатыСкачиванияФильмов.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Фильм.Установить(Ссылка);
			НаборЗаписей.Прочитать();
			Если НаборЗаписей.Количество() = 0 Тогда
				Запись = НаборЗаписей.Добавить();
				Запись.Фильм = Ссылка;
				Запись.ДатаСкачивания = ТекущаяДата();
			КонецЕсли;
			Попытка
			    НаборЗаписей.Записать();
			Исключение
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = "Ошибка записи фильма; по причине: " + ОписаниеОшибки();
				Сообщение.Сообщить();
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
